#!/usr/bin/env python
# coding: utf-8

# ## 程序输出
# - 将一个字符串赋值给a
# - 用print显示变量内容

# In[3]:


a = 'Hello World'


# In[4]:


print(a)


# ## 程序输入
# - Python3中input()默认数据为字符串

# In[6]:


age = input('enter your age:')


# ### 打印age

# In[8]:


print(age)


# ### 打印age的类型
# - age的类型为str(字符串)

# In[9]:


print(type(age))


# ## 注释
# - 单行注释使用#
# - 多行注释使用''' '''

# In[12]:


#这是一个单行注释


# ##  操作符
# - +：加法
# - -：减法
# - *：乘法
# - /：除法
# - //：整除
# - %：取余数
# - **：乘方

# In[14]:


2+2


# In[15]:


3-1


# In[16]:


2*4


# In[17]:


5/2


# In[18]:


5//2


# In[19]:


5%2


# In[20]:


2**4


# ## 比较运算符
# - < <= 
# - ==:等于
# - !=:不等于
# - 比较运算根据表达式的值的真假返回布尔值

# In[21]:


2 < 4


# In[22]:


2 == 4


# In[23]:


3 != 4

